#pragma once

#include <glm/glm.hpp>

/**
 * @brief Класс, представляющий источник света в трёхмерном пространстве.
 */
class Light {
private:
    glm::vec3 position; ///< Позиция источника света в трёхмерном пространстве.

public:
    /**
     * @brief Конструктор для инициализации позиции источника света.
     * 
     * @param position Позиция источника света в трёхмерном пространстве.
     */
    Light(const glm::vec3& position);

    /**
     * @brief Возвращает текущую позицию источника света.
     * 
     * @return Текущая позиция источника света в трёхмерном пространстве.
     */
    const glm::vec3& getPosition() const;

    /**
     * @brief Устанавливает новую позицию источника света.
     * 
     * @param pos Новая позиция источника света в трёхмерном пространстве.
     */
    void setPosition(const glm::vec3& pos);
};
